
Pdf = """PDF (Portable Document Format) — это универсальный формат электронных документов, созданный компанией Adobe.<br><br>
      ✔ Сохраняет исходное форматирование<br>
        ✔ Защита содержимого <br>
        ✔ Кроссплатформенность <br>
        ✔ Поддержка мультимедиа """


Jpeg = """JPEG (Joint Photographic Experts Group) — это популярный формат для хранения сжатых изображений с поддержкой миллионов цветов.<br><br>
      ✔ Оптимизирован для фото<br>
        ✔ Сжатие с потерями <br>
        ✔ Широкая совместимость <br>
        ✔ Не поддерживает прозрачность """


Docx = """DOCX — современный формат текстовых документов, созданный Microsoft для Word (2007 и новее).<br><br>
      ✔ Форматированный текст<br>
        ✔ Открытый стандарт <br>
        ✔ Меньший размер <br>
        ✔ Совместимость """


