
Pdf = """PDF (Portable Document Format) — это универсальный формат электронных документов, созданный компанией Adobe.<br><br>
      ✔ Сохраняет исходное форматирование<br>
        ✔ Защита содержимого <br>
        ✔ Кроссплатформенность <br>
        ✔ Поддержка мультимедиа """


Jpeg = """JPEG (Joint Photographic Experts Group) — это популярный формат для хранения сжатых изображений с поддержкой миллионов цветов.<br><br>
      ✔ Оптимизирован для фото<br>
        ✔ Сжатие с потерями <br>
        ✔ Широкая совместимость <br>
        💡 Не поддерживает прозрачность """


Docx = """DOCX — современный формат текстовых документов, созданный Microsoft для Word (2007 и новее).<br><br>
      ✔ Форматированный текст<br>
        ✔ Открытый стандарт <br>
        ✔ Меньший размер <br>
        ✔ Совместимость """

Png = """PNG (Portable Network Graphics) — популярный формат для изображений с поддержкой прозрачности и сжатием без потерь.<br><br>
      ✔ Прозрачный фон<br>
        ✔ Сжатие без потерь  <br>
        ✔ Поддержка большого количества цветов <br>
        💡 Не подходит для фото """

Webp = """WebP (Web Page) — современный формат изображений от Google, сочетающий сжатие с потерями и без потерь, а также поддержку прозрачности и анимации.<br><br>
      ✔ Меньший размер<br>
        ✔ Прозрачность и анимация <br>
        ✔ Подходит для веба <br>
        ✔ Кроссплатформа """


Heic = """HEIC (High Efficiency Image Container) — современный формат изображений, используемый Apple (начиная с iOS 11) для хранения фото в высоком качестве при меньшем размере файла.<br><br>
      ✔ Экономия места<br>
        ✔ Сохраняет глубину цвета <br>
        ✔ Хранит дополнительные данные <br>
        💡 Работает только на новых устройствах """

Bmp = """BMP (Bitmap) — простой несжатый формат для хранения растровых изображений.<br><br>
        ✔ Без потерь качества<br>
        ✔ Поддержка глубины цвета <br>
        ✔ Прозрачность  <br>
        💡 Большой размер файла """


Tiff = """TIFF (Tagged Image File Format) — профессиональный формат для хранения высококачественных изображений без потерь.<br><br>
        ✔ Гибкость <br>
        ✔ Высокая глубина цвета  <br>
        ✔ Слои и прозрачность  <br>
        ✔ Сохраняет метаданные  """