circle_area = """
<p>Площадь круга — это одна из ключевых концепций в геометрии, которая находит широкое применение в самых разных сферах: от архитектуры до естественных наук. Круг — это одна из самых простых и одновременно самых важных фигур, которую можно наблюдать в природе и искусстве. Понимание, как вычисляется площадь круга, является основой для решения множества практических задач.</p>

<p>Формула для вычисления площади круга проста и элегантна. Площадь круга вычисляется по формуле S = πr², где S — это площадь круга, π (пи) — математическая константа, приблизительно равная 3.14, а r — радиус круга. Радиус — это расстояние от центра круга до его границы. Это показывает, как площадь круга зависит от радиуса: если радиус увеличивается, площадь увеличивается в квадрате этого радиуса.</p>

<p>Интересно, что концепция площади круга существовала еще в древности. Уже в Древнем Египте и Древней Греции пытались найти способы определения площади круга. Архимед, знаменитый древнегреческий математик, использовал метод исчерпывания, который включал набросок многоугольников, чтобы приблизиться к площади круга. Его подход стал основой для многих математических открытий.</p>"""

circle_len = """
<p>Длина окружности – это один из основных понятий в геометрии, который описывает расстояние по периметру круга. Это важный элемент математики, который находит применение в различных областях, от инженерии до физики и повседневной жизни. </p>

<p>Сначала рассмотрим, что такое окружность. Окружность – это множество точек на плоскости, которые находятся на равном расстоянии от заданной точки, называемой центром круга. Это расстояние называется радиусом. Длина окружности определяется с помощью формулы: L = 2  π  R, где L – длина окружности, R – радиус, а π (пи) – математическая константа, примерно равная 3.14.</p>

<p>Понимание длины окружности может быть применено в различных контекстах. Например, если вы хотите построить круглый стол, знание длины окружности поможет рассчитать количество материала, необходимого для изготовления столешницы. Также эта информация полезна при проектировании дорожных знаков, колес и многих других объектов, имеющих круглую форму.</p>

"""

rectangle_area = """
<p>Площадь прямоугольника – это одна из базовых геометрических величин, которую необходимо знать не только ученикам, но и взрослым в повседневной жизни. Прямоугольник – это четырехугольник, у которого противолежащие стороны равны и расположены параллельно, а все углы равны 90 градусам. Благодаря этим особенностям, вычисление площади прямоугольника оказывается достаточно простым процессом.</p>

<p>Формула для вычисления площади прямоугольника выглядит так: 
<div class="quotes">
<div class="quotes-field">
<b>
S = a * b
</b>
</div>
</div>
где S – площадь, а a и b – длины сторон прямоугольника. Это означает, что для получения площади нужно просто умножить длину одной стороны на длину другой стороны. Например, если один край прямоугольника равен 5 метрам, а другой – 3 метра, то площадь будет равна 15 квадратных метров.</p>

<p>Важность понимания площади прямоугольника простирается далеко за пределы учебной программы. Мы сталкиваемся с необходимостью расчета площади в различных сферах жизни. Например, при ремонте квартиры необходимо рассчитать площадь пола для покупки нужного количества напольного покрытия. Также площадь прямоугольников применяется в сельском хозяйстве для определения размеров полей и участков, а в бизнесе – для оценки площади торговых помещений.</p>"""

rectangle_perimeter = """
<p>Периметр прямоугольника – это важная геометрическая величина, которая представляет собой сумму длин всех его сторон. Прямоугольник, как известно, является четырехугольником с двумя параллельными парами сторон, у которого все углы равны 90 градусам. Периметр вычисляется по простой формуле: P = 2(a + b), где P – периметр, a и b – длины сторон прямоугольника. Это означает, что для нахождения периметра необходимо сначала сложить длины двух соседних сторон, а затем умножить полученную сумму на два.</p>

<p>Зачем же нам нужен периметр? На практике периметр прямоугольника имеет множество применений. Например, при проведении строительных работ или обустройстве земельного участка необходимо знать, сколько материала требуется для ограждения длины периметра. Если мы строим забор, то именно длина периметра определяет, сколько метров материала нам нужно закупить.</p>

<p>Важность вычисления периметра также проявляется в дизайне и планировке интерьеров. Зная периметр помещения, дизайнеры могут точно рассчитать количество необходимых отделочных материалов, таких как обои, плинтуса и напольные покрытия. Например, если у вас есть комната размером 4 метра на 5 метров, то при вычислении периметра мы получаем P = 2(4 + 5) = 18 метров. Это поможет вам понять, сколько метров обоев потребуется, чтобы оклеить стены.</p>"""

square_area = """
<p>Площадь квадрата – простое и важное понятие в геометрии. Площадь квадрата — это числовая характеристика, которая показывает, сколько квадратных единиц занимает поверхность этой фигуры. Квадрат — это четырёхугольник с равными сторонами и четырьмя прямыми углами. Его уникальное свойство — все стороны равны по длине.
Вычислить площадь квадрата очень просто. Для этого достаточно знать длину одной стороны, так как формула площади квадрата выглядит следующим образом:</p>
<div class="quotes">
<div class="quotes-field">
<b>S = a × a </b>
или 
<b>S = a ²</b>
</div>
</div>
<p>Если сторона квадрата равна 5 сантиметрам, то площадь будет 5 × 5 = 25 квадратных сантиметров.Знание площади квадрата важно в различных областях — от строительства и дизайна до математики и физики. Например, при планировании комнаты с квадратной формой, чтобы узнать, сколько понадобится плитки, нужно вычислить площадь пола.
Также квадрат часто встречается в задачах, где необходимо вычислить площадь, сравнить размеры фигур или использовать свойства равных сторон. Таким образом, понятие площади квадрата — это фундаментальная часть геометрии, которая помогает решать практические задачи и глубже понимать свойства фигур. Простота вычисления площади квадрата делает её доступной и полезной для всех учащихся и специалистов.</p>
"""

square_perimeter = """
<p>Периметр квадрата – ключевое понятие в геометрии.Периметр квадрата — это сумма длин всех его сторон. Поскольку у квадрата все стороны равны, вычисление периметра достаточно простое и быстрое. Формула для расчета периметра выглядит так:</p>

<div class="quotes">
<div class="quotes-field">
<b>P = 4 × a</b>
</div>
</div>

<p>Если длина одной стороны квадрата составляет, например, 6 метров, то периметр будет равен 4 × 6 = 24 метра. Знание периметра квадрата полезно в различных областях, таких как строительство, архитектура и дизайн. Например, если нужно оградить квадратный участок земли, зная его периметр, можно легко рассчитать количество материала для забора.
Также периметр квадрата играет важную роль в математических задачах. Ученикам часто предлагают найти периметр квадрата, опираясь на его площадь, и наоборот. Это помогает развивать пространственное мышление и математические навыки.</p>"""

square_diag = """

<p>Диагональ квадрата — это отрезок, соединяющий две противоположные вершины. У квадрата, как у прямоугольника, диагонали равны и пересекаются под прямым углом. Чтобы вычислить длину диагонали, используется простая формула: </p>
<div class="quotes">
<div class="quotes-field">
<b>
D = a × √2
</b>
</div>
</div>
<p>Эта формула происходит из теоремы Пифагора. При рассмотрении квадрата с длиной стороны "a", диагональ образует треугольник с двумя сторонами и диагональю, которая является гипотенузой. Например, если сторона квадрата равна 5 см, тогда диагональ будет равна 5 × √2 ≈ 7,07 см.
Знание диагонали квадрата полезно во многих сферах, например, в дизайне интерьеров и архитектуре. При проектировании помещений важно учитывать диагонали, чтобы правильно расставить мебель или организовать пространство. Также диагональ имеет значение при вычислении площади, так как она помогает лучше понять размеры объектов.</p>"""

trap_area = """
<p>Площадь трапеции — одна из важных величин в геометрии, которая часто встречается при решении практических задач. 
Трапеция — это четырехугольник с двумя параллельными основаниями. Чтобы найти её площадь, нужно знать длины оснований и высоту.</p>

<p>Формула площади трапеции выглядит так:  </p>
Площадь = (Сумма оснований) / 2 × Высота

<p>Обозначим основания как a и b, а высоту как h, тогда:  </p>
<div class="quotes">
<div class="quotes-field">
<b>
S = ((a + b) / 2) × h
</b>
</div>
</div>
<p>Высота — это перпендикуляр, опущенный с одной из непараллельных сторон на основание. При помощи этой формулы легко вычислить площадь даже неправильной, наклонной трапеции.
Площадь трапеции активно используется в строительстве, инженерии и повседневной жизни: от расчётов площадей крыш и зданий до определения земельных участков.</p>
"""

trap_perimeter = """
<p>Периметр трапеции — это сумма длин всех её сторон. Трапеция, как известный четырехугольник, имеет две параллельные стороны, называемые основаниями, и две непараллельные стороны — боковые. Чтобы рассчитать периметр, необходимо знать длины всех этих сторон.</p>
<p>Формула периметра трапеции звучит так: </p>
<div class="quotes">
<div class="quotes-field">
<b>
P = a + b + c + d
</b>
</div>
</div>
<p>где a и b — длины оснований, а c и d — длины боковых сторон.Важно отметить, что наличие параллельных сторон не влияет на формулу, и периметр трапеции можно вычислить так же просто, как и для любого другого четырехугольника. Периметр играет существенную роль в практике: его часто используют для расчета длины ограждений, материалов для строительства и обрамления.</p>
"""


right_triangle_area = """
<p>Прямоугольный треугольник — это особый вид треугольника, у которого один угол равен 90 градусам. Площадь такого треугольника легко вычисляется и имеет практическое применение во многих областях, от строительства до дизайна.</p>
<p>Формула для вычисления площади прямоугольного треугольника выглядит следующим образом:  </p>
<div class="quotes">
<div class="quotes-field">
<b>
S = (a × b) / 2
</b>
</div>
</div>
<p>где S — площадь, а a и b — длины катетов. Катеты — это стороны, образующие прямой угол.Важной особенностью прямоугольного треугольника является то, что, зная длины катетов, можно сразу вычислить площадь, что упрощает многие задачи. 
Например, если один катет равен 3 см, а другой — 4 см, то площадь треугольника составит 6 см².</p>
"""

right_triangle_hypotenuse = """
<p>Гипотенуза — это самая длинная сторона прямоугольного треугольника, которая противопоставлена прямому углу. Она играет ключевую роль в геометрии и тригонометрии. Понимание гипотенузы важно для решения множества задач, связанных с физикой, архитектурой и инженерией.</p>
<p>Для нахождения длины гипотенузы можно использовать теорему Пифагора, которая гласит: "квадрат гипотенузы равен сумме квадратов катетов". Формула записывается как:  </p>
<div class="quotes">
<div class="quotes-field">
<b>
С =  √(a² + b²)
</b>
</div>
</div>
<p>где c — длина гипотенузы, а a и b — длины катетов. Это уравнение позволяет находить гипотенузу, если известны катеты.На практике, гипотенуза используется при проектировании лестниц, наклонных плоскостей и в других ситуациях, где необходимо учитывать расстояние и угол наклона. Например, если известно, что один катет равен 6 м, а другой — 8 м, то длина гипотенузы составит 10 м.</p>
"""